erpdev.СХК_Расширение/src/DataProcessors/СХК_СМФОтчет/СХК_СМФОтчет.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>СХК_СМФОтчет</name>
</mdclass:DataProcessor>

erpdev.СХК_Расширение/src/AccumulationRegisters/ДвиженияСерийТоваров/ДвиженияСерийТоваров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="1beaafd4-9e83-4fef-a24b-2ed1ba072beb">
  <name>ДвиженияСерийТоваров</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <registerType>Checked</registerType>
  </extension>
  <registerType>Turnovers</registerType>
  <dimensions extendedConfigurationObject="c0d120e9-7ff3-481b-9744-9fcd3fefabfc">
    <name>Серия</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="dbc39670-ee82-4e26-844b-f35d4c1c5544">
    <name>Номенклатура</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:AccumulationRegister>

erpdev.СХК_Расширение/src/DataProcessors/СХК_СМФОтчет/Forms/Форма/Module.bsl
&НаКлиенте
Процедура СформироватьП1(Команда)
	СформироватьПриложение1();
КонецПроцедуры

&НаСервере
Процедура СформироватьПриложение1() 
	
	ОтчетП1.Очистить();
	
	ДанныеРасшифровки = Неопределено;
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных; 
	Обработка =  РеквизитФормыВЗначение("Объект");
	МакетДокумента = Обработка.ПолучитьМакет("ОсновнаяСхемаКомпоновкиДанных"); 	
	
	КомпоновщикНоменклатура = Новый КомпоновщикНастроекКомпоновкиДанных;
	КомпоновщикНоменклатура.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(МакетДокумента));
	КомпоновщикНоменклатура.ЗагрузитьНастройки(МакетДокумента.НастройкиПоУмолчанию);

	КомпоновщикНоменклатура.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("Период", Период);
	КомпоновщикНоменклатура.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("Ставка", Ставка);
	
	//
	МакетКомпоновки = КомпоновщикМакета.Выполнить(МакетДокумента, КомпоновщикНоменклатура.ПолучитьНастройки(), ДанныеРасшифровки);
	ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
	
	ТабПродаж = НаборПродаж();
	
	ВнешниеНаборыДанных = Новый Структура("ТабПродаж", ТабПродаж);
	ПроцессорКомпоновки.Инициализировать(МакетКомпоновки, ВнешниеНаборыДанных, ДанныеРасшифровки, Истина);
	
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВывода.УстановитьДокумент(ОтчетП1);			// Выбор выходного табличного документа.
	ПроцессорВывода.Вывести(ПроцессорКомпоновки);
	ОтчетП1.ПоказатьУровеньГруппировокСтрок(0);

	
КонецПроцедуры    

&НаСервере
Функция НаборПродаж()
	Таб = Новый ТаблицаЗначений;
	Таб.Очистить();

	Запрос = Новый Запрос;
	Запрос.Текст ="ВЫБРАТЬ
//|	ДополнительныеСведения.Значение КАК Персонаж,
|	""                                                                      "" КАК Персонаж,
|	ДвиженияСерийТоваров.Регистратор КАК Регистратор,
|	ДвиженияСерийТоваров.Серия КАК Серия,
|	ДвиженияСерийТоваров.Номенклатура КАК Номенклатура,
|	ДвиженияСерийТоваров.Получатель КАК Контрагент,
|	ДвиженияСерийТоваров.Количество КАК Количество,
|	""СМФ"" КАК Артикул
|ПОМЕСТИТЬ ВТЗ
|ИЗ
|	РегистрНакопления.ДвиженияСерийТоваров КАК ДвиженияСерийТоваров
|ГДЕ
|	ДвиженияСерийТоваров.Серия.СХК_Префикс = &СХК_Префикс
|	И ДвиженияСерийТоваров.Период МЕЖДУ &ДатаНачала И &ДатаОкончания
|	И ДвиженияСерийТоваров.ЭтоСкладскоеДвижение = &ЭтоСкладскоеДвижение
|	И ДвиженияСерийТоваров.СкладскаяОперация = ЗНАЧЕНИЕ(Перечисление.СкладскиеОперации.ОтгрузкаКлиенту)
|
|СГРУППИРОВАТЬ ПО
|	ДвиженияСерийТоваров.Регистратор,
|	ДвиженияСерийТоваров.Серия,
|	ДвиженияСерийТоваров.Номенклатура,
|	ДвиженияСерийТоваров.Получатель,
|	ДвиженияСерийТоваров.Количество
|;
|
|////////////////////////////////////////////////////////////////////////////////
|ВЫБРАТЬ
|	СУММА(РеализацияТоваровУслугТовары.Сумма - РеализацияТоваровУслугТовары.СуммаНДС) КАК СуммаВыручкиБезНДС,
|	(РеализацияТоваровУслугТовары.Сумма - РеализацияТоваровУслугТовары.СуммаНДС) / ВТЗ.Количество КАК Цена,
|	ВТЗ.Артикул КАК Артикул,
|	СУММА(ВТЗ.Количество) КАК Количество,
|	ВТЗ.Контрагент КАК Контрагент,
|	ВТЗ.Номенклатура КАК Номенклатура,
|	ВТЗ.Персонаж КАК Персонаж
|ИЗ
|	Документ.РеализацияТоваровУслуг.Товары КАК РеализацияТоваровУслугТовары
|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТЗ КАК ВТЗ
|		ПО (РеализацияТоваровУслугТовары.Ссылка = ВТЗ.Регистратор)
|			И (РеализацияТоваровУслугТовары.Серия = ВТЗ.Серия)
|
|СГРУППИРОВАТЬ ПО
|	ВТЗ.Артикул,
|	ВТЗ.Контрагент,
|	ВТЗ.Номенклатура,
|	ВТЗ.Персонаж,
|	(РеализацияТоваровУслугТовары.Сумма - РеализацияТоваровУслугТовары.СуммаНДС) / ВТЗ.Количество";  
	
	Запрос.УстановитьПараметр("ЭтоСкладскоеДвижение",Ложь);
	Запрос.УстановитьПараметр("СХК_Префикс","СМФ");  
	Запрос.УстановитьПараметр("ДатаНачала",НачалоДня(Период.ДатаНачала));  
	Запрос.УстановитьПараметр("ДатаОкончания",КонецДня(Период.ДатаОкончания));  
	
	Результат = Запрос.Выполнить();
	СпособОбхода = ОбходРезультатаЗапроса.Прямой;
	Таб = Результат.Выгрузить(СпособОбхода);   
	
	Для Каждого стр из Таб Цикл 
		ДопСвойство = ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоРеквизиту("ИдентификаторДляФормул", "ПерсонажиПленки"); // Получение дополнительного реквизита 
		Значение = УправлениеСвойствами.ЗначениеСвойства(стр.Номенклатура.Ссылка, ДопСвойство);
		Если ЗначениеЗаполнено(Значение) Тогда
			стр.Персонаж = Значение.Наименование;	
		Иначе                                       
			стр.Персонаж = "";
		КонецЕсли;
	КонецЦикла;
	
	
	//Таб.Свернуть("Персонаж,Артикул,Серия,Номенклатура,Контрагент","Количество,СуммаВыручкиБезНДС");
	
	Возврат Таб;	
	
КонецФункции

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Период.ДатаНачала = НачалоМесяца(ТекущаяДата());
	Период.ДатаОкончания = КонецМесяца(ТекущаяДата());
	Ставка = 5; 
	Организация = "СмартБар Групп ООО";//Справочники.Организации.НайтиПоНаименованию("СмартБар Групп ООО");
КонецПроцедуры

&НаКлиенте
Процедура ОтчетВыбор(Элемент, Область, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияОбработкаВыбора(Элемент, ВыбранноеЗначение, ДополнительныеДанные, ВыборДобавлением, СтандартнаяОбработка) 
	СтандартнаяОбработка = Ложь;
	ОрганизацияОбработкаВыбораНаСервере(ВыбранноеЗначение);
КонецПроцедуры 

&НаСервере
Процедура ОрганизацияОбработкаВыбораНаСервере(ВыбранноеЗначение) 
	Если ВыбранноеЗначение = "1" Тогда
		Организация = "Собинский Хлебокомбинат АО";
	ИначеЕсли ВыбранноеЗначение = "2" Тогда 
		Организация = "СмартБар Групп ООО";
	КонецЕсли;			
КонецПроцедуры

&НаКлиенте
Процедура ВаловаяПрибыль(Команда) 
 ВнешнийОтчетСсылка = ПолучитьСсылкуНаВнешнийОтчетПоИмениНаСервере("Продажи");

   Если Не ЗначениеЗаполнено(ВнешнийОтчетСсылка) Тогда
       ПоказатьПредупреждение(, "Отчет не найден!");
       Возврат;
   КонецЕсли;

   Попытка
       ИмяОбработки = ДополнительныеОтчетыИОбработкиВызовСервера.ПодключитьВнешнююОбработку(ВнешнийОтчетСсылка);

       ПараметрыФормы = Новый Структура;
       ПараметрыФормы.Вставить("КлючВарианта", "Валовая прибыль предприятия (в)");
       ПараметрыФормы.Вставить("СформироватьПриОткрытии", Истина);

       ОткрытьФорму("ВнешнийОтчет." + ИмяОбработки + ".Форма", ПараметрыФормы, ЭтаФорма);
   Исключение
       ПоказатьПредупреждение(, "Ошибка при открытии отчета: " + ОписаниеОшибки());
   КонецПопытки;

КонецПроцедуры

&НаСервере
Функция ПолучитьСсылкуНаВнешнийОтчетПоИмениНаСервере(ИмяОтчета)

 Запрос = Новый Запрос;
   Запрос.Текст =
   "ВЫБРАТЬ
   |	ДополнительныеОтчетыИОбработки.Ссылка КАК Ссылка
   |ИЗ
   |	Справочник.ДополнительныеОтчетыИОбработки КАК ДополнительныеОтчетыИОбработки
   |ГДЕ
   |	ДополнительныеОтчетыИОбработки.Наименование = &ИмяОтчета
   |	И ДополнительныеОтчетыИОбработки.Родитель.Наименование = &Наименование
   |	И ДополнительныеОтчетыИОбработки.ЭтоГруппа = Ложь
   |";

   Запрос.УстановитьПараметр("ИмяОтчета", ИмяОтчета);
   Запрос.УстановитьПараметр("Наименование", "Отчеты");
   Результат = Запрос.Выполнить().Выгрузить();


   Возврат Результат[0].Ссылка;

КонецФункции
